// 随机选一组名字比较长的地名和一组名字比较短的地名测试4级显示
const Map<String, String> provincesDataNm = {
  "150000": "内蒙古自治区",
  "440000": "广东省",
};

const Map<String, dynamic> citiesDataNm = {
  "150000": {
    "150600": {"name": "鄂尔多斯市", "alpha": "e"},
  },
  "150600": {
    "150602": {"name": "东胜区", "alpha": "d"},
    "150603": {"name": "康巴什区", "alpha": "k"}
  },
  "150602": {
    "150602001": {"name": "交通街道办事处", "alpha": "j"},
    "150602002": {"name": "公园街道办事处", "alpha": "g"},
    "150602003": {"name": "林荫街道办事处", "alpha": "l"},
    "150602004": {"name": "建设街道办事处", "alpha": "j"},
    "150602005": {"name": "富兴街道办事处", "alpha": "f"},
    "150602006": {"name": "天骄街道办事处", "alpha": "t"},
    "150602007": {"name": "诃额伦街道办事处", "alpha": "k"},
    "150602008": {"name": "巴音门克街道办事处", "alpha": "b"},
    "150602010": {"name": "幸福街道办事处", "alpha": "x"},
    "150602011": {"name": "纺织街道办事处", "alpha": "f"},
    "150602012": {"name": "兴盛街道办事处", "alpha": "x"},
    "150602013": {"name": "民族街道办事处", "alpha": "m"},
    "150602100": {"name": "泊尔江海子镇", "alpha": "b"},
    "150602101": {"name": "罕台镇", "alpha": "h"},
    "150602102": {"name": "铜川镇", "alpha": "t"},
    "150602400": {"name": "鄂尔多斯市装备制造基地", "alpha": "e"},
    "150602401": {"name": "东胜区轻纺工业园区", "alpha": "d"},
    "150602404": {"name": "铜川汽车博览园", "alpha": "t"}
  },
  "150603": {
    "150603001": {"name": "哈巴格希街道办事处", "alpha": "h"},
    "150603002": {"name": "青春山街道办事处", "alpha": "q"},
    "150603003": {"name": "滨河街道办事处", "alpha": "b"},
    "150603008": {"name": "康新街道办事处", "alpha": "k"},
    "150603401": {"name": "鄂尔多斯市高新技术产业园区", "alpha": "e"},
    "150603402": {"name": "鄂尔多斯市云计算产业园区", "alpha": "e"}
  },

  "440000": {
    "440800": {"name": "湛江市", "alpha": "z"}
  },

  "440800": {
    "440883": {"name": "吴川市", "alpha": "w"}
  },

  "440883": {
    "440883001": {"name": "梅录街道", "alpha": "m"},
    "440883002": {"name": "塘尾街道", "alpha": "t"},
    "440883003": {"name": "大山江街道", "alpha": "d"},
    "440883004": {"name": "博铺街道", "alpha": "b"},
    "440883005": {"name": "海滨街道", "alpha": "h"},
    "440883100": {"name": "浅水镇", "alpha": "q"},
    "440883101": {"name": "长岐镇", "alpha": "c"},
    "440883102": {"name": "覃巴镇", "alpha": "q"},
    "440883103": {"name": "王村港镇", "alpha": "w"},
    "440883104": {"name": "振文镇", "alpha": "z"},
    "440883105": {"name": "樟铺镇", "alpha": "z"},
    "440883106": {"name": "吴阳镇", "alpha": "w"},
    "440883107": {"name": "塘缀镇", "alpha": "t"},
    "440883109": {"name": "黄坡镇", "alpha": "h"},
    "440883111": {"name": "兰石镇", "alpha": "l"}
  },


};
